; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v13 ?v1)
             (pred_11 ?v9 ?v11)
             (pred_4 ?v13 ?v11)
             (pred_5 ?v8 ?v13 )
	     (pred_3 ?v13)
             (pred_12 ?v4)
             (pred_10 ?v9)
             (pred_2 ?v11)
             (pred_6 ?v13)
             (pred_8 ?v9)
             (pred_9 ?v13)
             (pred_7 ))



(:action op_4
:parameters (?v12 ?v3 ?v6 ?v10)
:precondition (and (pred_12 ?v12) (pred_12 ?v3) (pred_10 ?v6) (pred_2 ?v10)
          (pred_1 ?v12 ?v3) (pred_11 ?v6 ?v10)
                   (pred_4 ?v3 ?v10) (pred_3 ?v12) 
                   (pred_6 ?v3) (pred_8 ?v6))
:effect (and  (pred_9 ?v3) (not (pred_6 ?v3))))


(:action op_1
:parameters (?v12 ?v2)
:precondition (and (pred_12 ?v12) (pred_12 ?v2)
               (pred_3 ?v12) (pred_1 ?v12 ?v2) (pred_9 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v12))))

(:action op_3
:parameters (?v12 ?v6)
:precondition (and (pred_12 ?v12) (pred_10 ?v6) 
                  (pred_3 ?v12) (pred_5 ?v6 ?v12) (pred_7 ))
:effect (and (pred_8 ?v6)
   (not (pred_5 ?v6 ?v12)) (not (pred_7 ))))


(:action op_5
:parameters (?v12 ?v7 ?v5)
:precondition (and (pred_12 ?v12) (pred_10 ?v7) (pred_10 ?v5)
                  (pred_3 ?v12) (pred_8 ?v5) (pred_5 ?v7 ?v12))
:effect (and (pred_8 ?v7) (pred_5 ?v5 ?v12)
        (not (pred_8 ?v5)) (not (pred_5 ?v7 ?v12))))

(:action op_2
:parameters (?v12 ?v6)
:precondition (and (pred_12 ?v12) (pred_10 ?v6) 
                  (pred_3 ?v12) (pred_8 ?v6))
:effect (and (pred_7 ) (pred_5 ?v6 ?v12) (not (pred_8 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_30 obj_09 obj_24 obj_19 obj_08 obj_02 obj_10 obj_11 obj_04 obj_21 obj_31 obj_16 obj_26 obj_14 obj_05 obj_22 obj_29 obj_01 obj_13 obj_25 obj_15 obj_12 obj_20 obj_23
    obj_03 obj_06 obj_07
    obj_18 obj_28 obj_27
    )

    (:init
       (pred_7)

       (pred_12 obj_17)
       (pred_12 obj_30)
       (pred_12 obj_09)
       (pred_12 obj_24)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_21)
       (pred_12 obj_31)
       (pred_12 obj_16)
       (pred_12 obj_26)
       (pred_12 obj_14)
       (pred_12 obj_05)
       (pred_12 obj_22)
       (pred_12 obj_29)
       (pred_12 obj_01)
       (pred_12 obj_13)
       (pred_12 obj_25)
       (pred_12 obj_15)
       (pred_12 obj_12)
       (pred_12 obj_20)
       (pred_12 obj_23)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_07)
       (pred_10 obj_18)
       (pred_10 obj_28)
       (pred_10 obj_27)

       (pred_1 obj_17 obj_08)
       (pred_1 obj_17 obj_30)
       (pred_1 obj_30 obj_02)
       (pred_1 obj_30 obj_09)
       (pred_1 obj_30 obj_17)
       (pred_1 obj_09 obj_10)
       (pred_1 obj_09 obj_24)
       (pred_1 obj_09 obj_30)
       (pred_1 obj_24 obj_11)
       (pred_1 obj_24 obj_19)
       (pred_1 obj_24 obj_09)
       (pred_1 obj_19 obj_04)
       (pred_1 obj_19 obj_24)
       (pred_1 obj_08 obj_21)
       (pred_1 obj_08 obj_02)
       (pred_1 obj_08 obj_17)
       (pred_1 obj_02 obj_31)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_02 obj_30)
       (pred_1 obj_02 obj_08)
       (pred_1 obj_10 obj_16)
       (pred_1 obj_10 obj_11)
       (pred_1 obj_10 obj_09)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_11 obj_26)
       (pred_1 obj_11 obj_04)
       (pred_1 obj_11 obj_24)
       (pred_1 obj_11 obj_10)
       (pred_1 obj_04 obj_14)
       (pred_1 obj_04 obj_19)
       (pred_1 obj_04 obj_11)
       (pred_1 obj_21 obj_05)
       (pred_1 obj_21 obj_31)
       (pred_1 obj_21 obj_08)
       (pred_1 obj_31 obj_22)
       (pred_1 obj_31 obj_16)
       (pred_1 obj_31 obj_02)
       (pred_1 obj_31 obj_21)
       (pred_1 obj_16 obj_29)
       (pred_1 obj_16 obj_26)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_16 obj_31)
       (pred_1 obj_26 obj_01)
       (pred_1 obj_26 obj_14)
       (pred_1 obj_26 obj_11)
       (pred_1 obj_26 obj_16)
       (pred_1 obj_14 obj_13)
       (pred_1 obj_14 obj_04)
       (pred_1 obj_14 obj_26)
       (pred_1 obj_05 obj_25)
       (pred_1 obj_05 obj_22)
       (pred_1 obj_05 obj_21)
       (pred_1 obj_22 obj_15)
       (pred_1 obj_22 obj_29)
       (pred_1 obj_22 obj_31)
       (pred_1 obj_22 obj_05)
       (pred_1 obj_29 obj_12)
       (pred_1 obj_29 obj_01)
       (pred_1 obj_29 obj_16)
       (pred_1 obj_29 obj_22)
       (pred_1 obj_01 obj_20)
       (pred_1 obj_01 obj_13)
       (pred_1 obj_01 obj_26)
       (pred_1 obj_01 obj_29)
       (pred_1 obj_13 obj_23)
       (pred_1 obj_13 obj_14)
       (pred_1 obj_13 obj_01)
       (pred_1 obj_25 obj_15)
       (pred_1 obj_25 obj_05)
       (pred_1 obj_15 obj_12)
       (pred_1 obj_15 obj_22)
       (pred_1 obj_15 obj_25)
       (pred_1 obj_12 obj_20)
       (pred_1 obj_12 obj_29)
       (pred_1 obj_12 obj_15)
       (pred_1 obj_20 obj_23)
       (pred_1 obj_20 obj_01)
       (pred_1 obj_20 obj_12)
       (pred_1 obj_23 obj_13)
       (pred_1 obj_23 obj_20)
       (pred_6 obj_01)
       (pred_6 obj_24)
       (pred_6 obj_19)
       (pred_4  obj_01 obj_03)
       (pred_4  obj_24 obj_06)
       (pred_4  obj_19 obj_07)
       (pred_9 obj_17)
       (pred_9 obj_30)
       (pred_9 obj_09)
       (pred_9 obj_08)
       (pred_9 obj_02)
       (pred_9 obj_10)
       (pred_9 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_21)
       (pred_9 obj_31)
       (pred_9 obj_16)
       (pred_9 obj_26)
       (pred_9 obj_14)
       (pred_9 obj_05)
       (pred_9 obj_22)
       (pred_9 obj_29)
       (pred_9 obj_13)
       (pred_9 obj_25)
       (pred_9 obj_15)
       (pred_9 obj_12)
       (pred_9 obj_20)
       (pred_9 obj_23)

       (pred_11  obj_18 obj_03)
       (pred_11  obj_28 obj_06)
       (pred_11  obj_27 obj_07)
       (pred_5 obj_18 obj_17)
       (pred_5 obj_28 obj_20)
       (pred_5 obj_27 obj_17)
       (pred_3 obj_21)
    )

    (:goal (and
       (pred_5 obj_27 obj_30)
    ))
(:constraints
  (always (not (pred_3 obj_08)))
)
)

; plan
1. (op_1 obj_21 obj_31)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_31)
   goals met: 0 of 1
2. (op_1 obj_31 obj_02)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_02)
   goals met: 0 of 1
3. (op_1 obj_02 obj_30)
   deleted: (pred_3 obj_02)
   added: (pred_3 obj_30)
   goals met: 0 of 1
4. (op_1 obj_30 obj_17)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_17)
   goals met: 0 of 1
5. (op_3 obj_17 obj_27)
   deleted: (pred_5 obj_27 obj_17) (pred_7)
   added: (pred_8 obj_27)
   goals met: 0 of 1
6. (op_1 obj_17 obj_30)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_30)
   goals met: 0 of 1
7. (op_2 obj_30 obj_27)
   deleted: (pred_8 obj_27)
   added: (pred_7) (pred_5 obj_27 obj_30)
   goals met: 1 of 1
